app/views/managers/_managers.html.erb

SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]
SELECT COUNT(*) FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]
---
<ul id="managers-list">
  <% if @league.managers.count == 0 %>