app/views/dues/_pot.html.erb

  <% if @league.commissioner.due.amount %>
  <h4><li class="font-inc">League Pot: $<%= (@league.managers.count + 1) * (@league.commissioner.due.amount) %></h4>
---
SELECT  "commissioners".* FROM "commissioners" WHERE "commissioners"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "dues".* FROM "dues" WHERE "dues"."commissioner_id" = $1 LIMIT 1  [["commissioner_id", 4]]
SELECT COUNT(*) FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 4]]