app/views/dues/index.html.erb


             <h3>League Pot: $<%= (@league.managers.count + 1) * (@league.commissioner.due.amount) %></h3>
---
SELECT  "dues".* FROM "dues" WHERE "dues"."commissioner_id" = $1 LIMIT 1  [["commissioner_id", 2]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]
SELECT COUNT(*) FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]