app/controllers/commissioners_controller.rb

  def show
    @commissioner = Commissioner.find(params[:id])
---
SELECT  "commissioners".* FROM "commissioners" WHERE "commissioners"."id" = $1 LIMIT 1  [["id", 2]]