app/controllers/dues_controller.rb

SELECT "dues".* FROM "dues" WHERE "dues"."league_id" = $1  [["league_id", 4]]
SELECT  "dues".* FROM "dues" WHERE "dues"."manager_id" = $1 LIMIT 1  [["manager_id", 4]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]
---
  def index
    @dues = current_user.leagues.first.dues
    @managers = current_user.leagues.first.managers

SELECT  "dues".* FROM "dues" WHERE "dues"."manager_id" = $1 LIMIT 1  [["manager_id", 8]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]
---
  def text_non_payers
    @managers = current_user.leagues.first.managers.select {|manager| !manager.due.paid}

SELECT  "dues".* FROM "dues" WHERE "dues"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @due = Due.find(params[:id])

SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]
SELECT  "dues".* FROM "dues" WHERE "dues"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "dues" SET "paid" = $1 WHERE "dues"."id" = $2  [["paid", "t"], ["id", 10]]
---
  def pay
    @league = current_user.leagues.first
    @managers = current_user.leagues.first.managers
    @due = Due.find_by(id: params[:id])
    @due.paid = true
    @due.save