app/controllers/leagues_controller.rb

  def manage_finances
    @dues = current_user.leagues.first.dues
    @managers = current_user.leagues.first.managers
---
SELECT "dues".* FROM "dues" WHERE "dues"."league_id" = $1  [["league_id", 1]]
SELECT  "dues".* FROM "dues" WHERE "dues"."manager_id" = $1 LIMIT 1  [["manager_id", 9]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]

  def get_finances
    @dues = current_user.leagues.first.dues
    @managers = current_user.leagues.first.managers
---
SELECT  "dues".* FROM "dues" WHERE "dues"."manager_id" = $1 LIMIT 1  [["manager_id", 9]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]