app/controllers/managers_controller.rb

SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 2]]
---
  def index
    @league = current_user.leagues.first
    @managers = current_user.leagues.first.managers

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 9]]
---
  def write_text
    @league = current_user.leagues.first
    @manager = Manager.find_by(id: params[:id])

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 8]]
---
  def edit
    @league = current_user.leagues.first
    @manager = Manager.find_by(id: params[:id])

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "managers" SET "name" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "managers"."id" = $4  [["name", "D"], ["phone_number", "6172850329"], ["updated_at", "2016-06-08 19:52:17.501743"], ["id", 10]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]
---
  def update
    @manager = Manager.find_by(id: params[:id])
    @manager = @manager.update(manager_params)
    @managers = current_user.leagues.first.managers

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 9]]
---
  def prompt
    @manager = Manager.find_by(id: params[:id])

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 8]]
---
  def write_email
    @manager = Manager.find_by(id: params[:id])

SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "managers" WHERE "managers"."id" = $1  [["id", 9]]
SELECT "managers".* FROM "managers" WHERE "managers"."league_id" = $1  [["league_id", 1]]
---
  def destroy
    @manager = Manager.find_by(id: params[:id])
    @league = @manager.league
    @manager.destroy
    @league = current_user.leagues.first
    @managers = current_user.leagues.first.managers