app/controllers/sessions_controller.rb

  def create
    commissioner = Commissioner.find_by(email: params[:email])

    if commissioner && commissioner.authenticate(params[:password])
      session[:user_id] = commissioner.id
      redirect_to league_path(commissioner.leagues.first)
---
SELECT  "commissioners".* FROM "commissioners" WHERE "commissioners"."email" = $1 LIMIT 1  [["email", "j@flatiron.com"]]
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."commissioner_id" = $1  ORDER BY "leagues"."id" ASC LIMIT 1  [["commissioner_id", 1]]